zhanglang-jqk/store-devece-esp8266/src/main.cpp
#if 1
/***********************************************************************
 * @file 	:	main.cpp
 * @author	:	CH
 * @brief	:
 * @Copyright (C)  2024-01-30  .cdWFVCEL. all right reserved
 ***********************************************************************/

/* include ------------------------------------------------------------------------------------------------- */
// #include "main.h"
#include "include.h"
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <Ticker.h>
#include <DNSServer.h>

#include "digit_out.h"
#include "led.h"
#include "key.hpp"
#include "debug.h"
#include "net_man.hpp"
#include "param.hpp"

#include "debug.h"
#include "cmd_pkt.h"
#include "TTS.h"
#include "tm1620.h"
#include "bonezegei_softserial.h"
/* macro definition ------------------------------------------------------------------------------------------------- */

#define SOFT_VERSION "1.2"

#define LED_RELAY_STAT 12
#define LED_SIGNAL 13
#define ON_LED_RELAY 0
#define OFF_LED_RELAY 1
#define ON_LED_SIGNAL 0
#define OFF_LED_SIGNAL 1

#define RELAY_GPIO 5
#define KEY_GPIO 2

#define CLK_PIN 14
#define DIO_PIN 13
#define STB_PIN 12

#define TTS_PIN_RX 16
#define TTS_PIN_TX 4
/* type definition ------------------------------------------------------------------------------------------------- */

/* variable declaration ------------------------------------------------------------------------------------------------- */
// LED led;
DOut relay;
Key key;
Ticker ticker;
NetClient net_client;
Param param;
CmdPkt cmd_pkt;
// SoftwareSerial softserial(TTS_PIN_RX, TTS_PIN_TX);
Bonezegei_SoftSerial softserial(TTS_PIN_RX, TTS_PIN_TX);

TTS tts;
TM1620 disp;
DNSServer dnsServer;
const byte DNS_PORT = 53;
IPAddress apIP(192, 168, 4, 1);

uint8_t g_tmpbuf[1024];

typedef struct
{
  uint8_t topic[32];
  uint8_t payload[32];
  bool send_f;
} PublicData_t;

struct
{
  enum
  {
    RETRY_WIFI_CONN_CNT = 3,   // WIFI 杩炴帴閲嶈瘯娆℃暟
    RETRY_MQTT_CONN_CNT = 3,   // MQTT 杩炴帴閲嶈瘯娆℃暟
    RETRY_MQTT_SUBPUB_CNT = 3, // MQTT 璁㈤槄鍙戝竷閲嶈瘯娆℃暟

    LOOP_PERIOD_MS = 50, // 涓诲惊鐜懆鏈?

    INIT_STAT,
    CONN_WIFI_STAT,
    CONN_MQTT_SVR_STAT,
    SYS_RESTART_STAT,
    APP_LOOP_STAT,
    MQTT_SUBSCRIPT_STAT,
    WIFI_INFO_CONFIG_STAT,
  };

  uint8_t retry_wifi_cnt = 0;
  uint8_t retry_mqtt_cnt = 0;
  uint8_t retry_mqtt_subpub_cnt = 0;
  uint8_t stat = INIT_STAT;

  uint32_t last_ms_st = 0; // 涓婃鏃堕棿鎴?

  struct
  {
    uint8_t stat;
    uint8_t LOOP_PERIOD_MS = 10; // 10MS
    uint8_t RETRY_TTS_CNT = 3;   // 閲嶈瘯娆℃暟
    uint32_t period_last_ms_st;
    // uint32_t wait_response_last_ms; // 涓婃鏃堕棿鎴?
    uint8_t playbuf[32];
    uint16_t playbuf_len;
    bool play_cmd_f;
    uint8_t retry_cnt;
  } play_voice_fsm;

  struct
  {
    bool count_down_start_f;
    uint8_t stat;
    uint32_t count_down_inc_sec;
    // uint32_t count_down_inc_minute;
    uint32_t minute_last_ms_st;
    uint32_t sec_last_ms_st;
    uint8_t disp_colon_f;
  } count_down_fsm;

  struct
  {
    uint8_t stat;
    uint16_t LOOP_PERIOD_MS = 1000;
    uint32_t last_ms_st;
  } param_fsm;

  struct
  {
    uint8_t stat;
    uint8_t LOOP_PERIOD_MS = 10; // 10MS
    uint32_t last_ms_st;
    bool ap_en; // 0:鍏抽棴AP, 1:鎵撳紑AP
    bool config_finish_f;
  } web_server_fsm;

  struct
  {
    uint8_t stat;
    uint8_t LOOP_PERIOD_MS = 10; // 10MS
    uint32_t last_ms_st;
  } key_fsm;

  struct
  {
    uint8_t stat;
    String ssid, pwd;
    bool cfg_finish_f;
  } wifi_cfg_fsm;

  struct
  {
    // uint8_t stat;
    uint32_t last_ms;
    uint8_t retry_cnt;
    const uint16_t LOOP_PERIOD_MS = 1000;
    const uint8_t MAX_RETRY_CNT = 3;
  } conn_mqtt_svr_fsm;

  struct
  {
    uint8_t stat;
    uint32_t last_ms;
    const uint16_t LOOP_PERIOD_MS = 500;
    bool disp_f;
  } net_seg_indicate_fsm;

  struct
  {
    uint8_t stat; // 鎸囩ず鑱旂綉鐘舵€佹垨鎸囩ず鍊掕鏃剁姸鎬?
    const uint16_t MAIN_SCAN_PERIOD_MS = 500;
    uint32_t main_last_ms;
    bool conn_svr_f;
    bool disp_val_f;
  } seg_disp_fsm;

  struct // TODO wait for implement
  {
    PublicData_t report_count_down_finish;
    PublicData_t report_relay_state_update;
    PublicData_t report_query_relay_state;
    PublicData_t report_play_voice_cmd_ok;
    PublicData_t report_play_voice_cmd_err;
  } public_data_fsm;

} ctrl_fsm;
/* function declaration ------------------------------------------------------------------------------------------------- */
void Key_cb(Key::KeyEvent_et key_event);
void MQTTRecv_cb(char *topic, uint8_t *payload, uint16_t length);
void WebServer_cb();
void setupCaptivePortal();
String toStringIp(IPAddress ip);

/* function implementation ------------------------------------------------------------------------------------------------- */
void setup()
{
  Serial.begin(115200);
  tpf("Power on..............");

  // led.Init(LED_SIGNAL, OUTPUT, DOut::ON_POLARITY_LOW);
  relay.Init(RELAY_GPIO, DOut::ON_POLARITY_HIGH);
  key.Init(KEY_GPIO, INPUT_PULLUP, Key_cb, Key::KEY_LOW);

  softserial.begin(9600); // TODO 鎵撳紑杩欎釜锛屽氨浼氬鑷寸郴缁熸棤娉曡繍琛?
  tts.Init(&softserial);
  disp.Init(STB_PIN, CLK_PIN, DIO_PIN);
  param.Init();
  net_client.Init(MQTTRecv_cb);
}

void loop()
{
  if (millis() - ctrl_fsm.last_ms_st > ctrl_fsm.LOOP_PERIOD_MS)
  {
    // tp();

    if (ctrl_fsm.stat == ctrl_fsm.INIT_STAT) // 鏍规嵁宸蹭繚瀛樼殑缁х數鍣ㄧ姸鎬佹帶鍒剁户鐢靛櫒
    {
      // tp();
      tpf("free stack:%d, free heap:%d", ESP.getFreeContStack(), ESP.getFreeHeap());
      // param.ResetAllParamToDefault();
      param.LoadAllParam();
      tpt(param.ToString(&param.cur_data));

      ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
    }
#if 1
    else if (ctrl_fsm.stat == ctrl_fsm.CONN_WIFI_STAT) // connect to Wifi
    {
      // tp();

      NetClient::WiFiConnResult_et wifi_conn_result = (NetClient::WiFiConnResult_et)net_client.ConnWifi((char *)param.cur_data.wifi_ssid, (char *)param.cur_data.wifi_pwd);
      if (wifi_conn_result == NetClient::WIFI_CONNECED)
      {
        tpf("connect to wifi successful");

        ctrl_fsm.retry_wifi_cnt = 0;
        ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt = 0;
        ctrl_fsm.stat = ctrl_fsm.CONN_MQTT_SVR_STAT;
        ctrl_fsm.conn_mqtt_svr_fsm.last_ms = millis();
      }
      else if (wifi_conn_result == NetClient::WIFI_CONNECT_TIMEOUT)
      {
        if (++ctrl_fsm.retry_wifi_cnt > ctrl_fsm.RETRY_WIFI_CONN_CNT)
        {
          ctrl_fsm.stat = ctrl_fsm.SYS_RESTART_STAT;
          tpf("try connect wifi is failed so then restart system");
        }
        tpf("The %d times, try conenct to wifi is failed", ctrl_fsm.retry_wifi_cnt);
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.CONN_MQTT_SVR_STAT) // connect to MQTT server
    {
      if (millis() - ctrl_fsm.conn_mqtt_svr_fsm.last_ms >= ctrl_fsm.conn_mqtt_svr_fsm.LOOP_PERIOD_MS)
      {
        tpf("connect mqtt server, server:%s, port:%d, id:%s, username:%s, password:%s", param.cur_data.mqtt_server, param.cur_data.mqtt_port, param.cur_data.device_id,
            param.cur_data.mqtt_username, param.cur_data.mqtt_password);

        bool isok = net_client.ConnServer((char *)param.cur_data.mqtt_server, param.cur_data.mqtt_port, (char *)param.cur_data.device_id, (char *)param.cur_data.mqtt_username,
                                          (char *)param.cur_data.mqtt_password);
        if (isok)
        {
          tpf("connect to mqtt server successful");

          ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt = 0;
          ctrl_fsm.stat = ctrl_fsm.MQTT_SUBSCRIPT_STAT;
        }
        else
        {
          if (++ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt >= ctrl_fsm.conn_mqtt_svr_fsm.MAX_RETRY_CNT)
          {
            ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;

            tpf("try connect mqtt server is failed so then reconnect wifi");
          }
          tpf("The %d times, try conenct to mqtt server is failed", ctrl_fsm.conn_mqtt_svr_fsm.retry_cnt);
        }

        ctrl_fsm.conn_mqtt_svr_fsm.last_ms = millis();
      }
    }
    else if (ctrl_fsm.stat == ctrl_fsm.MQTT_SUBSCRIPT_STAT)
    {
      tp();
      char *pub_topic = (char *)g_tmpbuf, *device_sub_topic = (char *)g_tmpbuf, *device_pub_topic = (char *)g_tmpbuf;
      pub_topic = (char *)param.cur_data.pub_topic;
      sprintf((char *)device_sub_topic, "%s/%s", param.cur_data.device_id, param.cur_data.device_pub_topic);
      sprintf((char *)device_pub_topic, "%s/%s", param.cur_data.device_id, param.cur_data.device_sub_topic);

      bool isok1 = net_client.Subscribe(pub_topic);
      tpf("subscribe topic is:%s", (char *)pub_topic);
      bool isok2 = net_client.Subscribe(device_pub_topic);
      tpf("subscribe topic is:%s", (char *)device_pub_topic);
      bool isok3 = net_client.Subscribe(device_sub_topic);
      tpf("subscribe topic is:%s", (char *)device_sub_topic);

