zhanglang-jqk/store-devece-esp8266/src/main.cpp
        if ((millis() - ctrl_fsm.count_down_fsm.minute_last_ms_st >= 60 * 1000) || (ctrl_fsm.count_down_fsm.minute_last_ms_st == 0)) // 1 minute
        {
          tp();
          if (ctrl_fsm.count_down_fsm.minute_last_ms_st != 0) param.cur_data.count_down_minute--;

          uint8_t hour = param.cur_data.count_down_minute / 60;
          uint8_t hour_10 = hour / 10 % 10, hour_1 = hour % 10;
          uint8_t minute = param.cur_data.count_down_minute % 60;
          uint8_t minute_10 = minute / 10 % 10, minute_1 = minute % 10;

          tpf("count down minute is %d", param.cur_data.count_down_minute);
          tpf("hour_10:%d, hour_1:%d, minute_10:%d, minute_1:%d", hour_10, hour_1, minute_10, minute_1);

          for (int i = 0; i < 4; i++)
            disp.DispSeg(i, TM1620::SEG_NOT_DISPLAY);

          uint8_t skip_num = 0;
          if (param.cur_data.count_down_minute / 60 >= 10)
            skip_num = 0;
          else if (param.cur_data.count_down_minute / 60 >= 1)
            skip_num = 1;
          else if (param.cur_data.count_down_minute % 60 >= 10)
            skip_num = 2;
          else if (param.cur_data.count_down_minute % 60 >= 1)
            skip_num = 3;
          switch (skip_num)
          {
          case 0:
            disp.DispSeg(0, hour_10);
          case 1:
            disp.DispSeg(1, hour_1);
          case 2:
            disp.DispSeg(2, minute_10);
          case 3:
            disp.DispSeg(3, minute_1);
          }

          ctrl_fsm.count_down_fsm.minute_last_ms_st = millis();
        }
        if ((millis() - ctrl_fsm.count_down_fsm.sec_last_ms_st >= 1000) || (ctrl_fsm.count_down_fsm.sec_last_ms_st == 0)) // 1s
        {
          uint8_t skip_num = 0;
          if (param.cur_data.count_down_minute / 60 >= 10)
            skip_num = 0;
          else if (param.cur_data.count_down_minute / 60 >= 1)
            skip_num = 1;
          else if (param.cur_data.count_down_minute % 60 >= 10)
            skip_num = 2;
          else if (param.cur_data.count_down_minute % 60 >= 1)
            skip_num = 3;
          // tpf("skip_num:%d", skip_num);
          if (skip_num > 1) // only toggle display ":"
          {
            if (ctrl_fsm.count_down_fsm.disp_colon_f)
            {
              // tp();
              disp.DispSeg(1, TM1620::SEG_NOT_DISPLAY);
            }
            else
            {
              // tp();
              disp.DispSeg(1, TM1620::SEG_COLON);
            }
          }
          else // must be display number and ":"
          {
            uint8_t hour = param.cur_data.count_down_minute / 60;
            uint8_t hour_1 = hour % 10;

            if (ctrl_fsm.count_down_fsm.disp_colon_f)
            {
              // tp();
              disp.DispSegCode(1, disp.GetCodeNum(hour_1)); // only display "number"
            }
            else
            {
              // tp();
              disp.DispSegCode(1, disp.GetCodeNum(hour_1) | 0x80); // display ":" and "number"
            }
          }

          ctrl_fsm.count_down_fsm.disp_colon_f = !ctrl_fsm.count_down_fsm.disp_colon_f;
          ctrl_fsm.count_down_fsm.sec_last_ms_st = millis();
        }

        if (param.cur_data.count_down_minute == 0)
        {
          ctrl_fsm.count_down_fsm.count_down_start_f = false;
        }
        if (ctrl_fsm.count_down_fsm.count_down_start_f == false)
        {
          ctrl_fsm.count_down_fsm.stat = 2;
        }
      }
      // then count down finished or received "count down stop" cmd
      // reset default content to number segment
      if (ctrl_fsm.count_down_fsm.stat == 2)
      {
        // tp();
        disp.DispSeg(0, TM1620::SEG_ROD), disp.DispSeg(1, TM1620::SEG_ROD), disp.DispSeg(2, TM1620::SEG_ROD), disp.DispSeg(3, TM1620::SEG_ROD);
        ctrl_fsm.count_down_fsm.stat = 0;
        ctrl_fsm.count_down_fsm.minute_last_ms_st = 0;
        ctrl_fsm.count_down_fsm.sec_last_ms_st = 0;

        uint8_t sbuf[32];
        memset(sbuf, 0, sizeof(sbuf));
        cmd_pkt.BuildJsonPkt((char *)sbuf, "count down", (char *)"finish");
        net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);
      }
    }

    ctrl_fsm.seg_disp_fsm.main_last_ms = millis();
  }
#endif

  { // param logic
    if (ctrl_fsm.param_fsm.stat == 0)
    {
      ctrl_fsm.param_fsm.last_ms_st = millis();
      ctrl_fsm.param_fsm.stat = 1;
    }
    else if (ctrl_fsm.param_fsm.stat == 1)
    {
      if (millis() - ctrl_fsm.param_fsm.last_ms_st >= ctrl_fsm.param_fsm.LOOP_PERIOD_MS) // 1S
      {
        param.UpdateParam_pool();
      }
    }
  }
#if 1
  { // web server logic
    if (ctrl_fsm.web_server_fsm.stat == 0)
    {
      ctrl_fsm.web_server_fsm.last_ms_st = millis();
      ctrl_fsm.web_server_fsm.stat = 1;
    }
    else if (ctrl_fsm.web_server_fsm.stat == 1)
    {
      if (millis() - ctrl_fsm.web_server_fsm.last_ms_st >= ctrl_fsm.web_server_fsm.LOOP_PERIOD_MS) // 10ms
      {
        if (ctrl_fsm.web_server_fsm.ap_en) {
          dnsServer.processNextRequest();
          net_client.WebServer_pool();
        }
        ctrl_fsm.web_server_fsm.last_ms_st = millis();
      }
    }
  }
#endif

#if 1
  { // key logic
    if (ctrl_fsm.key_fsm.stat == 0)
    {
      // tp();
      ctrl_fsm.key_fsm.last_ms_st = millis();
      ctrl_fsm.key_fsm.stat = 1;
    }
    else if (ctrl_fsm.key_fsm.stat == 1)
    {
      if (millis() - ctrl_fsm.key_fsm.last_ms_st >= ctrl_fsm.key_fsm.LOOP_PERIOD_MS)
      {
        // tp();
        key.pool();
        ctrl_fsm.key_fsm.last_ms_st = millis();
      }
    }
  }
#endif
}

void Key_cb(Key::KeyEvent_et key_event)
{
  if (key_event == Key::KeyEvent_et::CLICK)
  {
    tpf("key short press");
    bool state = relay.Toggle();
    tpf("relay state is %d", state);
    param.cur_data.relay = (uint8_t)state;
  }
  else if (key_event == Key::KeyEvent_et::LONG_CLICK) // wifi config by hot point
  {
    tpf("key long press");
    uint8_t buf[] = {0xbf,0xaa,0xca,0xbc,0xc5,0xe4,0xcd,0xf8};  // 播报,开始配网
    tts.SendPlayVoice_cmd(buf, sizeof(buf));
    net_client.WebServer_start((char *)param.cur_data.ap_ssid, (char *)param.cur_data.ap_pwd, WebServer_cb);
    setupCaptivePortal();
    ctrl_fsm.web_server_fsm.ap_en = true;
    ctrl_fsm.stat = ctrl_fsm.WIFI_INFO_CONFIG_STAT;
  }
  else if (key_event == Key::KeyEvent_et::DOUBLE_CLICK)
  {
    tpf("key double press");
  }
}

void WebServer_cb() 
{
  tp();
  ctrl_fsm.wifi_cfg_fsm.ssid = net_client.GetArg("ssid");
  ctrl_fsm.wifi_cfg_fsm.pwd = net_client.GetArg("password");
  Serial.println("Received SSID: " + ctrl_fsm.wifi_cfg_fsm.ssid);
  Serial.println("Received Password: " + ctrl_fsm.wifi_cfg_fsm.pwd);
  strcpy((char *)param.cur_data.wifi_ssid, ctrl_fsm.wifi_cfg_fsm.ssid.c_str());
  strcpy((char *)param.cur_data.wifi_pwd, ctrl_fsm.wifi_cfg_fsm.pwd.c_str());

  if (ctrl_fsm.wifi_cfg_fsm.ssid.length() != 0 && ctrl_fsm.wifi_cfg_fsm.pwd.length() != 0)
  {
    ctrl_fsm.web_server_fsm.config_finish_f = true;
  }

  tpf("config wifi infomation is finished");
  String response = "{\"status\":\"success\",\"message\":\"WiFi 配置完成\"}";
  NetClient::server.send(200, "application/json", response);
  delay(800), ESP.wdtFeed(), delay(800), ESP.wdtFeed();

