zhanglang-jqk/store-devece-esp8266/src/main.cpp
  uint8_t buf[] = {0xc5,0xe4,0xcd,0xf8,0xcd,0xea,0xb3,0xc9};  // 播报"配网完成"的GBK编码
  tts.SendPlayVoice_cmd(buf, sizeof(buf));

  net_client.WebServer_stop();
  ctrl_fsm.web_server_fsm.ap_en = false;
  ctrl_fsm.wifi_cfg_fsm.stat = 0;
  ctrl_fsm.stat = ctrl_fsm.CONN_WIFI_STAT;
  ctrl_fsm.web_server_fsm.config_finish_f = false;
}

void setupCaptivePortal() {
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
  WiFi.softAP((char *)param.cur_data.ap_ssid, (char *)param.cur_data.ap_pwd);

  // Configure DNS server to redirect all domains to the AP's IP
  dnsServer.start(DNS_PORT, "*", apIP);

  NetClient::server.on("/", HTTP_GET, []() {
    NetClient::server.sendHeader("Location", String("http://") + toStringIp(NetClient::server.client().localIP()), true);
    NetClient::server.send(302, "text/plain", "");
  });

  NetClient::server.onNotFound([]() {
    NetClient::server.sendHeader("Location", String("http://") + toStringIp(NetClient::server.client().localIP()), true);
    NetClient::server.send(302, "text/plain", "");
  });
}

String toStringIp(IPAddress ip) {
  String res = "";
  for (int i = 0; i < 3; i++) {
    res += String((ip >> (8 * i)) & 0xFF) + ".";
  }
  res += String(((ip >> 8 * 3)) & 0xFF);
  return res;
}

/**
 * @brief Callback function for receiving MQTT messages.
 *
 * This function is called when an MQTT message is received.
 * It parses the received message and performs corresponding actions based on the command.
 *
 * @param topic The topic of the received message.
 * @param payload The payload of the received message.
 * @param length The length of the payload.
//  */
void MQTTRecv_cb(char *topic, uint8_t *payload, uint16_t length)
{
#if 1
  char _payload[length + 1];
  memset(_payload, 0, sizeof(_payload)), memcpy(_payload, payload, length);
  tpf("MQTTRecv_cb, topic:%s, payload:%s", topic, _payload);

  static char device_sub_topic[64];
  memset(device_sub_topic, 0, sizeof(device_sub_topic));
  sprintf(device_sub_topic, "%s/%s", param.cur_data.device_id, param.cur_data.device_sub_topic);

  if (strcmp(topic, device_sub_topic) == 0)
  {
    char cmd_no[5];
    memset(cmd_no, 0, sizeof(cmd_no));
    cmd_pkt.GetCmdNo(cmd_no, payload, length);
    tpf("cmd_no:%s", cmd_no);

    if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_SERVER_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_server);
      // param.WriteParam(Param::MQTT_SERVER_ID, param.data.mqtt_server, strlen((char *)param.data.mqtt_server));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_WIFI_SSID_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.wifi_ssid);
      // param.WriteParam(Param::WIFI_SSID_ID, param.data.wifi_ssid, strlen((char *)param.data.wifi_ssid));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_WIFI_PWD_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.wifi_pwd);
      // param.WriteParam(Param::WIFI_PWD_ID, param.data.wifi_pwd, strlen((char *)param.data.wifi_pwd));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_USERNAME_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_username);
      // param.WriteParam(Param::MQTT_USERNAME_ID, param.data.mqtt_username, strlen((char *)param.data.mqtt_username));
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_PASSWORD_CMD) == 0)
    {
      cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)param.cur_data.mqtt_password);
      // param.WriteParam(Param::MQTT_PASSWORD_ID, param.data.mqtt_password, strlen((char *)param.data.mqtt_password));
    }
    else if (strcmp(cmd_no, CmdPkt::OPEN_RELAY_CMD) == 0)
    {
      param.cur_data.relay = (uint8_t)relay.On();
      tpf("received cmd, open relay");
    }
    else if (strcmp(cmd_no, CmdPkt::CLOSE_RELAY_CMD) == 0)
    {
      param.cur_data.relay = (uint8_t)relay.Off();
      tpf("received cmd, close relay");
    }
    else if (strcmp(cmd_no, CmdPkt::GET_RELAY_STATUS_CMD) == 0)
    {
      char sbuf[32];
      memset(sbuf, 0, sizeof(sbuf));
      if (relay.GetPinState() == DOut::ON_STATUS)
        cmd_pkt.BuildJsonPkt(sbuf, CmdPkt::RELAY_STATUS_CMD, (char *)"on");
      else
        cmd_pkt.BuildJsonPkt(sbuf, CmdPkt::RELAY_STATUS_CMD, (char *)"off");

      net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);
    }
    else if (strcmp(cmd_no, CmdPkt::GET_DEVICE_ID_CMD) == 0)
    {
      char sbuf[48];
      memset(sbuf, 0, sizeof(sbuf));
      cmd_pkt.BuildJsonPkt(sbuf, CmdPkt::GET_DEVICE_ID_CMD, (char *)param.cur_data.device_id);

      net_client.Publish((char *)param.cur_data.device_pub_topic, (char *)sbuf);
    }
    else if (strcmp(cmd_no, CmdPkt::MODIFY_MQTT_PORT_CMD) == 0)
    {
      uint16_t port;
      cmd_pkt.ExtractIntOfBuf((char *)payload, length, &port);
      param.cur_data.mqtt_port = port;
    }
    else if (strcmp(cmd_no, CmdPkt::PLAY_VOICE) == 0)
    {
      ctrl_fsm.play_voice_fsm.play_cmd_f = true;
      // cmd_pkt.ExtractStrOfBuf((char *)payload, length, (char *)ctrl_fsm.play_voice_fsm.playbuf);
      ctrl_fsm.play_voice_fsm.playbuf_len = cmd_pkt.ExtractGbkHexStrOfBuf((char *)payload, length, ctrl_fsm.play_voice_fsm.playbuf);
    }
    else if (strcmp(cmd_no, CmdPkt::SET_COUNT_DOWN) == 0)
    {
      uint16_t count_down = 0;
      cmd_pkt.ExtractIntOfBuf((char *)payload, length, &count_down);
      param.cur_data.count_down_minute = count_down;
      tpf("cound down: %d", count_down);
    }
    else if (strcmp(cmd_no, CmdPkt::OPEN_COUNT_DOWN) == 0)
    {
      tpf("open count down");
      ctrl_fsm.count_down_fsm.count_down_start_f = true;
    }
    else if (strcmp(cmd_no, CmdPkt::CLOSE_COUNT_DOWN) == 0)
    {
      tpf("close count down");
      ctrl_fsm.count_down_fsm.count_down_start_f = false;
    }
    else
    {
      tpf("unknow cmd");
    }
  }

#endif
}
#endif

// main.cpp
